app/controllers/app_noticias_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 2)
SELECT * FROM `app_profiles` WHERE (`app_profiles`.`profile_id` = 2) LIMIT 1
---
  def index

        if session[:user_id]
              @user=User.find(session[:user_id])
              if @user
                    @profile_id = @user.profile_id
              end
        end
  	@noticias = Contenido.find_noticias_del_perfil(@profile_id)