app/controllers/contenidos_controller.rb

SELECT * FROM `contenidos`
---
  def index
    @contenidos = Contenido.all

SELECT * FROM `tipo_contenidos` WHERE (`tipo_contenidos`.`id` = 1)
---
  def show
    @contenido = Contenido.find(params[:id])

SELECT * FROM `contenidos` WHERE (`contenidos`.`id` = 1)
---
  def edit
    @contenido = Contenido.find(params[:id])

INSERT INTO `contenidos` (`created_at`, `updated_at`, `descripcion`, `app_id`, `rotacion`, `tipo_id`, `fecha`) VALUES('2010-09-21 14:23:28', '2010-09-21 14:23:28', 'Menu usuario Administrador', 3, NULL, 2, '2010-09-21')
---
  def create
    @contenido = Contenido.new(params[:contenido])

    respond_to do |format|
      if @contenido.save

SELECT * FROM `contenidos` WHERE (`contenidos`.`id` = 1)
UPDATE `contenidos` SET `updated_at` = '2010-09-15 02:53:38', `descripcion` = 'Jornada de Integración. ' WHERE `id` = 1
---
  def update
    @contenido = Contenido.find(params[:id])

    respond_to do |format|
      if @contenido.update_attributes(params[:contenido])

SELECT * FROM `contenidos` WHERE (`contenidos`.`id` = 6)
DELETE FROM `contenidos` WHERE `id` = 6
---
  def destroy
    @contenido = Contenido.find(params[:id])
    @contenido.destroy