app/controllers/elementos_controller.rb

SELECT * FROM `elementos`
---
  def index
    @elementos = Elemento.all

SELECT * FROM `tipo_elementos` WHERE (`tipo_elementos`.`id` = 2)
---
  def show
    @elemento = Elemento.find(params[:id])

SELECT * FROM `elementos` WHERE (`elementos`.`id` = 5)
---
  def edit
    @elemento = Elemento.find(params[:id])

INSERT INTO `elementos` (`ubicacion`, `created_at`, `contenido_id`, `updated_at`, `valor`, `tipo_id`) VALUES(1, '2010-09-15 02:58:00', 2, '2010-09-15 02:58:00', 'http://3.bp.blogspot.com/_HVsObiMuNWI/ShNWTwQ-6rI/AAAAAAAAAWo/I1nYYUp1KvI/s1600-h/Jornada.jpg', 2)
---
  def create
    @elemento = Elemento.new(params[:elemento])

    respond_to do |format|
      if @elemento.save

SELECT * FROM `elementos` WHERE (`elementos`.`id` = 5)
UPDATE `elementos` SET `updated_at` = '2010-09-15 03:07:07', `valor` = 'http://1.bp.blogspot.com/_HVsObiMuNWI/ST8YSikVPVI/AAAAAAAAAWc/zH6GN69fQUw/s1600-h/INV.jpg' WHERE `id` = 5
---
  def update
    @elemento = Elemento.find(params[:id])

    respond_to do |format|
      if @elemento.update_attributes(params[:elemento])

SELECT * FROM `elementos` WHERE (`elementos`.`id` = 4)
DELETE FROM `elementos` WHERE `id` = 4
---
  def destroy
    @elemento = Elemento.find(params[:id])
    @elemento.destroy